УТ_для_edt/src/Documents/смартASP_БонусыДопЗаслуги/смартASP_БонусыДопЗаслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_БонусыДопЗаслуги</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднийКурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Бонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартASP_НакоплениеБонусов/смартASP_НакоплениеБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартASP_НакоплениеБонусов</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипБонуса</name>
    <type>
      <types>EnumRef.смартASP_ТипыБонусов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартASP_ТипыБонусов/смартASP_ТипыБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартASP_ТипыБонусов</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <enumValues>
    <name>УчастиеВПродажахКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>ЗапускиОборудования</name>
  </enumValues>
  <enumValues>
    <name>РешениеЗадачСЦ</name>
  </enumValues>
  <enumValues>
    <name>Командировки</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеСтандартаСО</name>
  </enumValues>
  <enumValues>
    <name>Переработки</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ЗаЧипы</name>
  </enumValues>
  <enumValues>
    <name>Знания</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеМаркетинговыхМероприятий</name>
    <comment>#6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_БонусыДопЗаслуги/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Начисления.Итог("Бонус")>СуммаРаспределения Тогда
		Сообщить("Итоговый бонус превышает доступную сумму для распределения");
		Отказ=Истина; 
		Возврат;
	КонецЕсли;
    
	Движения.смартASP_НакоплениеБонусов.Очистить();
	Движения.смартASP_НакоплениеБонусов.Записывать = Истина;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если смартСтатусРасчетаБонусов <> Перечисления.смартСтатусыДокументовРасчетаБонусов.РасчетЗавершен Тогда
		Возврат;
	КонецЕсли;	
	//--#1288 смарт: Лопато 26.12.2022

	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Если ТекСтрокаНачисления.Бонус <> 0 Тогда 
			Движение = Движения.смартASP_НакоплениеБонусов.Добавить();
			Движение.Период = Дата;
			Движение.ТипБонуса = Перечисления.смартASP_ТипыБонусов.РешениеЗадачСЦ;
			Движение.Инженер = ТекСтрокаНачисления.Инженер;
			Движение.Сумма = ТекСтрокаНачисления.Бонус;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  	
	
	смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров  	

	смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	
КонецПроцедуры //--#1288 смарт: Лопато 29.12.2022

#КонецЕсли
